package com.javarush.task.task18.task1817;

/* 
Пробелы
В метод main первым параметром приходит имя файла.
Вывести на экран соотношение количества пробелов к количеству всех символов. Например, 10.45.
1. Посчитать количество всех символов.
2. Посчитать количество пробелов.
3. Вывести на экран п2/п1*100, округлив до 2 знаков после запятой.
4. Закрыть потоки.
Требования:
1. Считывать с консоли ничего не нужно.
2. Создай поток чтения из файла, который приходит первым параметром в main.
3. Посчитай отношение пробелов ко всем символам в файле и выведи в консоль это число.
4. Выведенное значение необходимо округлить до 2 знаков после запятой.
5. Поток чтения из файла должен быть закрыт.
*/

import java.io.BufferedReader;
import java.io.FileInputStream;
import java.io.InputStreamReader;
import java.math.BigDecimal;
import java.text.DecimalFormat;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Solution {
    //public static final String TEXT = "Мне очень нравится Тайланд. Таиланд это то место куда бы я поехал. тайланд - мечты сбываются!";
    public static void main(String[] args) throws  Exception{
        FileInputStream stream = new FileInputStream(args[0]);
        double spaceCount= 0;
        int charCount = 0;
        while(stream.available()>0) {
            char c = (char) stream.read();
            charCount++;
            if (c == ' ') spaceCount++;
        }
        stream.close();


        //Matcher matcher = p.matcher(TEXT);

        DecimalFormat df = new DecimalFormat("###.##");
        System.out.println(df.format(spaceCount/charCount*100));



    }
}
